app/controllers/api/uploads_controller.rb

INSERT INTO "uploads" ("name", "path", "type", "uploader_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "hello"], ["path", "users/cookies.mp4"], ["type", "video"], ["uploader_id", 27], ["created_at", "2019-09-11 00:52:36.305915"], ["updated_at", "2019-09-11 00:52:36.305915"]]
---
    def create
        @upload = Upload.new(upload_params)
        @upload.uploader_id = current_user.id

        if @upload.save