app/models/user.rb

    def self.find_by_credentials(email, password)
      user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "gp@me.com"], ["LIMIT", 1]]

    def generate_unique_session_token
      self.session_token = new_session_token
      while User.find_by(session_token: self.session_token)
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "022amYAW57tMkJQvu8ggrg"], ["LIMIT", 1]]